<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">String Data Type</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">In MySQL, a string data type is used to store character data. There are several types of string data types available:
<ul><h3>CHAR :</h3><ul><br>
<li>This data type is used to store fixed-length strings. </li><br>
<li>The length of the string is specified when the table is created, and the field will always use that amount of
space, regardless of whether the string stored in it is shorter or longer</li><br>
<li>For example, if you define a CHAR(10) field and store the string "hello" in it, MySQL
will pad the string with spaces so that it takes up 10 characters.</li> <br>
<li>CHAR fields are useful when you have a field that always contains the same length of data, such as
a state abbreviation or a phone number.</li>
</ul>
</ul>

</div>

In [2]:
%load_ext sql
%sql mysql+pymysql://root:@localhost:3307/str

In [5]:
%%sql
CREATE TABLE d1(
    n1 CHAR(6),
    n2 CHAR(6)
)

 * mysql+pymysql://root:***@localhost:3307/str
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now insert value</div>

In [6]:
%%sql
INSERT INTO str.d1(n1,n2)
VALUES ('Mubeen','M')

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[]

In [7]:
%%sql
SELECT * FROM d1

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[('Mubeen', 'M')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now try to insert 7 Characters in n1</div>

In [9]:
%%sql
INSERT INTO str.d1(n1,n2)
VALUES ('MubeenA','M')

 * mysql+pymysql://root:***@localhost:3307/str
(pymysql.err.DataError) (1406, "Data too long for column 'n1' at row 1")
[SQL: INSERT INTO str.d1(n1,n2)
VALUES ('MubeenA','M')]
(Background on this error at: https://sqlalche.me/e/20/9h9h)

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><h3>VARCHAR :</h3><ul><br>
<li>This data type is used to store variable-length strings.</li><br>
<li>The length of the string can be up to a specified maximum, but the field will only use as much space
as it needs to store the actual data.</li><br>
<li>For example, if you define a VARCHAR(10) field and store the string "hello" in it, MySQL will only use 5 characters to store the
data. </li><br>
<li>VARCHAR fields are useful when you have a field that can contain varying
amounts of data, such as a user's name or address.
</ul>
</ul>

</div>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Creating new table</div>

In [10]:
%%sql
CREATE TABLE d2(
    n1 VARCHAR(6),
    n2 VARCHAR(6)
)

 * mysql+pymysql://root:***@localhost:3307/str
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Insert value</div>

In [11]:
%%sql
INSERT INTO str.d2(n1,n2)
VALUES ('Mubeen','M')

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[]

In [12]:
%%sql
SELECT * FROM d2

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[('Mubeen', 'M')]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><h3>TEXT:</h3><ul><br>
<li>This data type is used to store larger amounts of variable-length string data
than VARCHAR.</li><br> 
<li>It can store up to 65,535 characters. TEXT fields are useful when
you need to store large amounts of text data, such as blog posts or comments.</li>
</ul>
</ul>

</div>

In [14]:
%%sql
CREATE TABLE d3(
    n1 TEXT(10),
    n2 TEXT(10)
)

 * mysql+pymysql://root:***@localhost:3307/str
0 rows affected.

[]

In [15]:
%%sql
INSERT INTO str.d3(n1,n2)
VALUES ('Mubeen','Ahmad')

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[]

In [16]:
%%sql
SELECT * FROM d3

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[('Mubeen', 'Ahmad')]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><h3>MEDIUMTEXT :</h3><ul><br>
<li>This data type is used to store even larger amounts of text data
than TEXT.</li> <br>
<li>It can store up to 16,777,215 characters.</li><br> 
<li>MEDIUMTEXT fields are useful
when you need to store very large amounts of text data, such as long-form articles
or legal documents.</li>
</ul>
</ul>

</div>

In [31]:
%%sql
CREATE TABLE d5(
    n1 MEDIUMTEXT  
)

 * mysql+pymysql://root:***@localhost:3307/str
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">here we dont need for define a size bcz 16,777,215 is the fixed size
</div>

In [33]:
%%sql
INSERT INTO str.d5(n1)
VALUES ('Mubeen Ahmad')

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[]

In [34]:
%%sql
SELECT * FROM d5

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[('Mubeen Ahmad',)]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><h3>LONGTEXT :</h3><ul><br>
<li>This data type is used to store the largest amounts of text data.</li><br> 
<li>It can store up to 4,294,967,295 characters.</li><br> 
<li>LONGTEXT fields are useful when you need to store extremely large amounts of text data, such as entire books or large
collections of data</li>
</ul>
</ul>

</div>

In [35]:
%%sql
CREATE TABLE d6(
    n1 LONGTEXT  
)

 * mysql+pymysql://root:***@localhost:3307/str
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">here also we dont need for define a size bcz 4,294,967,295 is the fixed size
</div>

In [57]:
%%sql
INSERT INTO str.d6(n1)

VALUES ("
Programming, a dynamic and intricate field, is often marked by its constant evolution and the challenges it presents. One of the inevitable companions in the journey of a programmer is the concept of errors. Errors, though seemingly frustrating, are an integral part of the coding process, serving as guideposts on the road to improvement.
Errors in programming can broadly be classified into three categories: syntax errors, runtime errors, and logical errors. Syntax errors occur during the coding phase when the programmer violates the language's grammatical rules. These errors are usually caught by the compiler and must be fixed before the program can be executed.
Runtime errors, on the other hand, manifest during the program's execution. They often result from unexpected conditions or inputs that the programmer did not anticipate. These errors can lead to the program crashing or behaving unpredictably. Identifying and addressing runtime errors requires careful debugging and testing.
Logical errors, the most subtle of the trio, occur when the program runs without any syntax or runtime issues but does not produce the desired output. These errors stem from flawed logic in the code and can be challenging to spot. Debugging tools and a systematic approach to problem-solving are crucial in resolving logical errors.
Despite their challenges, errors are not enemies but rather teachers in the realm of programming. Each error provides an opportunity for learning and improvement. The process of fixing errors sharpens a programmer's analytical skills, attention to detail, and problem-solving abilities. It fosters a mindset of resilience and adaptability, essential qualities in the fast-paced world of technology.
Moreover, the evolution of programming languages and development tools has significantly contributed to error management. Modern Integrated Development Environments (IDEs) offer real-time error highlighting, suggestions, and auto-correction features, streamlining the debugging process. These advancements empower programmers to write cleaner and more efficient code.
In conclusion, errors are not obstacles to be feared but challenges to be embraced in the realm of programming. They serve as stepping stones towards mastery, pushing programmers to refine their skills and produce robust, error-free code. As technology continues to advance, the understanding and management of errors remain fundamental in creating innovative and reliable software solutions.
")

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[]

In [58]:
%%sql
SELECT * FROM d6

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[("\nProgramming, a dynamic and intricate field, is often marked by its constant evolution and the challenges it presents. One of the inevitable compani ... (2201 characters truncated) ... hnology continues to advance, the understanding and management of errors remain fundamental in creating innovative and reliable software solutions.\n",)]

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Wildcards</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
    <ul>The LIKE operator in MySQL is used to match a string value against a pattern using wildcard characters.<br><br>
<li>It is commonly used in SELECT, WHERE, and JOIN clauses to filter or join rows based on a pattern match.</li><br>
<li>The LIKE operator uses two wildcard characters: <ul><li>the percent sign (%) and the underscore (_).</li></ul> </li><br>
<li>The percent sign represents zero, one, or more characters, while the underscore represents a single character.</li></ul></div>

In [59]:
%sql SELECT * FROM mydb.movies LIMIT 3

 * mysql+pymysql://root:***@localhost:3307/str
3 rows affected.

[('The Shining', 'R', 'Drama', 1980, 'June 13, 1980 (United States)', 8.4, 927000, 'Stanley Kubrick', 'Stephen King', 'Jack Nicholson', 'United Kingdom', 19000000, 46998772.0, 'Warner Bros.', 146),
 ('The Blue Lagoon', 'R', 'Adventure', 1980, 'July 2, 1980 (United States)', 5.8, 65000, 'Randal Kleiser', 'Henry De Vere Stacpoole', 'Brooke Shields', 'United States', 4500000, 58853106.0, 'Columbia Pictures', 104),
 ('Star Wars: Episode V - The Empire Strikes Back', 'PG', 'Action', 1980, 'June 20, 1980 (United States)', 8.7, 1200000, 'Irvin Kershner', 'Leigh Brackett', 'Mark Hamill', 'United States', 18000000, 538375067.0, 'Lucasfilm', 124)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> _(Underscore)<br><br> For Example we need only 5 characters name 
</div>

In [64]:
%%sql
SELECT * FROM mydb.movies
WHERE name LIKE "_____"
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/str
5 rows affected.

[('Fatso', 'PG', 'Comedy', 1980, 'February 1, 1980 (United States)', 6.3, 2000, 'Anne Bancroft', 'Anne Bancroft', 'Dom DeLuise', 'United States', 0, 7653061.0, 'Brooksfilms', 93),
 ('Thief', 'R', 'Action', 1981, 'March 27, 1981 (United States)', 7.4, 27000, 'Michael Mann', 'Frank Hohimer', 'James Caan', 'United States', 5500000, 11492915.0, 'Mann/Caan Productions', 123),
 ('Venom', 'R', 'Horror', 1981, 'January 29, 1982 (United States)', 5.8, 2600, 'Piers Haggard', 'Alan Scholefield', 'Klaus Kinski', 'United Kingdom', 0, 5229643.0, 'Morison Film Group', 92),
 ('Annie', 'PG', 'Comedy', 1982, 'June 18, 1982 (United States)', 6.6, 41000, 'John Huston', 'Carol Sobieski', 'Aileen Quinn', 'United States', 50000000, 57063861.0, 'Columbia Pictures', 127),
 ('Diner', 'R', 'Comedy', 1982, 'May 21, 1982 (United States)', 7.1, 19000, 'Barry Levinson', 'Barry Levinson', 'Steve Guttenberg', 'United States', 5000000, 14099953.0, 'Metro-Goldwyn-Mayer (MGM)', 110)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Extract 5 characters name but starting first character is A 
</div>

In [65]:
%%sql
SELECT * FROM mydb.movies
WHERE name LIKE "A_____"
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/str
5 rows affected.

[('Arthur', 'PG', 'Comedy', 1981, 'July 17, 1981 (United States)', 6.9, 27000, 'Steve Gordon', 'Steve Gordon', 'Dudley Moore', 'United States', 7000000, 95461682.0, 'Orion Pictures', 97),
 ('Aliens', 'R', 'Action', 1986, 'July 18, 1986 (United States)', 8.3, 668000, 'James Cameron', 'James Cameron', 'Sigourney Weaver', 'United Kingdom', 18500000, 131060248.0, 'Twentieth Century Fox', 137),
 ('Always', 'PG', 'Drama', 1989, 'December 22, 1989 (United States)', 6.4, 29000, 'Steven Spielberg', 'Jerry Belson', 'Richard Dreyfuss', 'United States', 31000000, 74134790.0, 'Universal Pictures', 122),
 ('Avalon', 'PG', 'Drama', 1990, 'October 19, 1990 (United States)', 7.2, 5900, 'Barry Levinson', 'Barry Levinson', 'Aidan Quinn', 'United States', 20000000, 15779578.0, 'TriStar Pictures', 128),
 ('Alaska', 'PG', 'Adventure', 1996, 'August 14, 1996 (United States)', 5.8, 5200, 'Fraser C. Heston', 'Andy Burg', 'Thora Birch', 'United States', 23000000, 11829959.0, 'Castle Rock Entertainment', 109)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> % (Percentage)<br><br> For Example we need only man with any charcters 
</div>

In [66]:
%%sql
SELECT * FROM mydb.movies
WHERE name LIKE "%man%"
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/str
5 rows affected.

[('Superman II', 'PG', 'Action', 1980, 'June 19, 1981 (United States)', 6.8, 101000, 'Richard Lester', 'Jerry Siegel', 'Gene Hackman', 'United States', 54000000, 108185706.0, 'Dovemead Films', 127),
 ('The Stunt Man', 'R', 'Action', 1980, 'June 27, 1980 (United States)', 7.1, 9000, 'Richard Rush', 'Lawrence B. Marcus', "Peter O'Toole", 'United States', 3500000, 7063886.0, 'Melvin Simon Productions', 131),
 ('The Boogey Man', 'R', 'Horror', 1980, 'November 7, 1980 (United States)', 4.6, 3900, 'Ulli Lommel', 'Ulli Lommel', 'Suzanna Love', 'United States', 300000, None, 'The Jerry Gross Organization', 82),
 ('The Fiendish Plot of Dr. Fu Manchu', 'PG', 'Comedy', 1980, 'August 8, 1980 (United States)', 5.1, 2000, 'Piers Haggard', 'Rudy Dochtermann', 'Peter Sellers', 'United States', 0, 10697276.0, 'Braun Entertainment Group', 100),
 ('Mantis Fist Fighter', None, 'Action', 1980, 'July 9, 1982 (United States)', 6.7, 230, 'Wing-Cho Yip', 'Hsin-Yi Chang', 'Ka-Yan Leung', 'Hong Kong', 0, None, 'East Asia Film Company', 89)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"><br><br> Extract movies which name in man at the Starting 
</div>

In [77]:
%%sql
SELECT * FROM mydb.movies
WHERE name LIKE "man%"
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/str
5 rows affected.

[('Mantis Fist Fighter', None, 'Action', 1980, 'July 9, 1982 (United States)', 6.7, 230, 'Wing-Cho Yip', 'Hsin-Yi Chang', 'Ka-Yan Leung', 'Hong Kong', 0, None, 'East Asia Film Company', 89),
 ('Man, Woman and Child', 'PG', 'Drama', 1983, 'September 7, 1983 (France)', 6.1, 368, 'Dick Richards', 'Erich Segal', 'Martin Sheen', 'United States', 0, 2314561.0, 'Gaylord Productions', 99),
 ('Manhunter', 'R', 'Crime', 1986, 'August 15, 1986 (United States)', 7.2, 68000, 'Michael Mann', 'Thomas Harris', 'William Petersen', 'United States', 15000000, 8621783.0, 'De Laurentiis Entertainment Group (DEG)', 120),
 ('Manon of the Spring', 'PG', 'Drama', 1986, 'December 4, 1987 (United States)', 8.0, 21000, 'Claude Berri', 'Claude Berri', 'Yves Montand', 'Switzerland', 0, 3940542.0, 'DD Productions', 113),
 ('Man Facing Southeast', 'R', 'Drama', 1986, 'March 13, 1987 (United States)', 7.7, 3800, 'Eliseo Subiela', 'Eliseo Subiela', 'Lorenzo Quinteros', 'Argentina', 600000, None, 'Cinequanon', 105)]

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">String Useful Functions</h1>

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><h3>Upper() and Lower()</h3><ul><br>
    <li>Upper Convert text in uppercase while lowere convert into lowercase</li>
</ul>
</ul>

</div>

In [82]:
%%sql
SELECT 
UPPER(name) , LOWER(name)
FROM mydb.movies
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/str
10 rows affected.

[('THE SHINING', 'the shining'),
 ('THE BLUE LAGOON', 'the blue lagoon'),
 ('STAR WARS: EPISODE V - THE EMPIRE STRIKES BACK', 'star wars: episode v - the empire strikes back'),
 ('AIRPLANE!', 'airplane!'),
 ('CADDYSHACK', 'caddyshack'),
 ('FRIDAY THE 13TH', 'friday the 13th'),
 ('THE BLUES BROTHERS', 'the blues brothers'),
 ('RAGING BULL', 'raging bull'),
 ('SUPERMAN II', 'superman ii'),
 ('THE LONG RIDERS', 'the long riders')]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><h3>concat()</h3><ul><br>
    <li>concat is use for concatenation the string</li>
</ul>
</ul>

</div>

In [96]:
%%sql
SELECT 

CONCAT('Name : ',name,'\n','Director : ',director,'\nStar : ',star)

FROM mydb.movies
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/str
10 rows affected.

[('Name : The Shining\nDirector : Stanley Kubrick\nStar : Jack Nicholson',),
 ('Name : The Blue Lagoon\nDirector : Randal Kleiser\nStar : Brooke Shields',),
 ('Name : Star Wars: Episode V - The Empire Strikes Back\nDirector : Irvin Kershner\nStar : Mark Hamill',),
 ('Name : Airplane!\nDirector : Jim Abrahams\nStar : Robert Hays',),
 ('Name : Caddyshack\nDirector : Harold Ramis\nStar : Chevy Chase',),
 ('Name : Friday the 13th\nDirector : Sean S. Cunningham\nStar : Betsy Palmer',),
 ('Name : The Blues Brothers\nDirector : John Landis\nStar : John Belushi',),
 ('Name : Raging Bull\nDirector : Martin Scorsese\nStar : Robert De Niro',),
 ('Name : Superman II\nDirector : Richard Lester\nStar : Gene Hackman',),
 ('Name : The Long Riders\nDirector : Walter Hill\nStar : David Carradine',)]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><h3>Concat_WS()</h3><ul><br>
    <li>Concat_WS add a seprator between the string</li>
</ul>
</ul>

</div>

In [100]:
%%sql
SELECT 

CONCAT_WS('\n',name,director,star)

FROM mydb.movies
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/str
10 rows affected.

[('The Shining\nStanley Kubrick\nJack Nicholson',),
 ('The Blue Lagoon\nRandal Kleiser\nBrooke Shields',),
 ('Star Wars: Episode V - The Empire Strikes Back\nIrvin Kershner\nMark Hamill',),
 ('Airplane!\nJim Abrahams\nRobert Hays',),
 ('Caddyshack\nHarold Ramis\nChevy Chase',),
 ('Friday the 13th\nSean S. Cunningham\nBetsy Palmer',),
 ('The Blues Brothers\nJohn Landis\nJohn Belushi',),
 ('Raging Bull\nMartin Scorsese\nRobert De Niro',),
 ('Superman II\nRichard Lester\nGene Hackman',),
 ('The Long Riders\nWalter Hill\nDavid Carradine',)]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><h3>Substr(col,start,length)</h3><ul><br>
    <li>SUBSTR function is used to extract a substring from a string</li>
</ul>
</ul>

</div>

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> Start string Form 2
</div>

In [104]:
%%sql
SELECT 

name,SUBSTR(name,2)

FROM mydb.movies
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/str
10 rows affected.

[('The Shining', 'he Shining'),
 ('The Blue Lagoon', 'he Blue Lagoon'),
 ('Star Wars: Episode V - The Empire Strikes Back', 'tar Wars: Episode V - The Empire Strikes Back'),
 ('Airplane!', 'irplane!'),
 ('Caddyshack', 'addyshack'),
 ('Friday the 13th', 'riday the 13th'),
 ('The Blues Brothers', 'he Blues Brothers'),
 ('Raging Bull', 'aging Bull'),
 ('Superman II', 'uperman II'),
 ('The Long Riders', 'he Long Riders')]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> Start string Form 2 but length is only 2
</div>

In [114]:
%%sql
SELECT 

name,SUBSTR(name,2,2) 

-- he Shining   --> he

FROM mydb.movies
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/str
10 rows affected.

[('The Shining', 'he'),
 ('The Blue Lagoon', 'he'),
 ('Star Wars: Episode V - The Empire Strikes Back', 'ta'),
 ('Airplane!', 'ir'),
 ('Caddyshack', 'ad'),
 ('Friday the 13th', 'ri'),
 ('The Blues Brothers', 'he'),
 ('Raging Bull', 'ag'),
 ('Superman II', 'up'),
 ('The Long Riders', 'he')]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> We also use negative indexing <br> Note in sql indexing start with 1 not zero
</div>

In [122]:
%%sql
SELECT 

name,SUBSTR(name,-7) 

FROM mydb.movies
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/str
10 rows affected.

[('The Shining', 'Shining'),
 ('The Blue Lagoon', ' Lagoon'),
 ('Star Wars: Episode V - The Empire Strikes Back', 'es Back'),
 ('Airplane!', 'rplane!'),
 ('Caddyshack', 'dyshack'),
 ('Friday the 13th', 'he 13th'),
 ('The Blues Brothers', 'rothers'),
 ('Raging Bull', 'ng Bull'),
 ('Superman II', 'rman II'),
 ('The Long Riders', ' Riders')]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">use length
</div>

In [123]:
%%sql
SELECT 

name,SUBSTR(name,-7,5) 

FROM mydb.movies
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/str
10 rows affected.

[('The Shining', 'Shini'),
 ('The Blue Lagoon', ' Lago'),
 ('Star Wars: Episode V - The Empire Strikes Back', 'es Ba'),
 ('Airplane!', 'rplan'),
 ('Caddyshack', 'dysha'),
 ('Friday the 13th', 'he 13'),
 ('The Blues Brothers', 'rothe'),
 ('Raging Bull', 'ng Bu'),
 ('Superman II', 'rman '),
 ('The Long Riders', ' Ride')]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><h3>Replace(string,select,replacing)</h3><ul><br>
    <li>Replace a string</li>
</ul>
</ul>

</div>

In [134]:
%%sql
SELECT 
name,REPLACE(name,'The','When') 
FROM mydb.movies
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/str
10 rows affected.

[('The Shining', 'When Shining'),
 ('The Blue Lagoon', 'When Blue Lagoon'),
 ('Star Wars: Episode V - The Empire Strikes Back', 'Star Wars: Episode V - When Empire Strikes Back'),
 ('Airplane!', 'Airplane!'),
 ('Caddyshack', 'Caddyshack'),
 ('Friday the 13th', 'Friday the 13th'),
 ('The Blues Brothers', 'When Blues Brothers'),
 ('Raging Bull', 'Raging Bull'),
 ('Superman II', 'Superman II'),
 ('The Long Riders', 'When Long Riders')]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><h3>Reverse</h3><ul><br>
    <li>Reverse a string</li>
</ul>
</ul>

</div>

In [140]:
%%sql
SELECT 
name,REVERSE(name)
FROM mydb.movies
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/str
10 rows affected.

[('The Shining', 'gninihS ehT'),
 ('The Blue Lagoon', 'noogaL eulB ehT'),
 ('Star Wars: Episode V - The Empire Strikes Back', 'kcaB sekirtS eripmE ehT - V edosipE :sraW ratS'),
 ('Airplane!', '!enalpriA'),
 ('Caddyshack', 'kcahsyddaC'),
 ('Friday the 13th', 'ht31 eht yadirF'),
 ('The Blues Brothers', 'srehtorB seulB ehT'),
 ('Raging Bull', 'lluB gnigaR'),
 ('Superman II', 'II namrepuS'),
 ('The Long Riders', 'srediR gnoL ehT')]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Extract a palindrome name
</div>

In [141]:
%%sql
SELECT name FROM mydb.movies
WHERE name = REVERSE(name)

 * mysql+pymysql://root:***@localhost:3307/str
3 rows affected.

[('Anna',), ('Dad',), ('O',)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><h3>length</h3><ul><br>
    <li>Length of the string in bytes</li>
</ul>
</ul>

</div>

In [142]:
%%sql
SELECT name,LENGTH(name) FROM mydb.movies
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/str
10 rows affected.

[('The Shining', 11),
 ('The Blue Lagoon', 15),
 ('Star Wars: Episode V - The Empire Strikes Back', 46),
 ('Airplane!', 9),
 ('Caddyshack', 10),
 ('Friday the 13th', 15),
 ('The Blues Brothers', 18),
 ('Raging Bull', 11),
 ('Superman II', 11),
 ('The Long Riders', 15)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><h3>CHAR_LENGTH</h3><ul><br>
    <li>Length of the string with characters</li>
</ul>
</ul>

</div>

In [143]:
%%sql
SELECT name,CHAR_LENGTH(name) FROM mydb.movies
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/str
10 rows affected.

[('The Shining', 11),
 ('The Blue Lagoon', 15),
 ('Star Wars: Episode V - The Empire Strikes Back', 46),
 ('Airplane!', 9),
 ('Caddyshack', 10),
 ('Friday the 13th', 15),
 ('The Blues Brothers', 18),
 ('Raging Bull', 11),
 ('Superman II', 11),
 ('The Long Riders', 15)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><h3>where both are not same</h3><ul><br>
    <li>The main difference between CHAR_LENGTH and LENGTH is that
CHAR_LENGTH returns the length of a string in characters, while
LENGTH returns the length of a string in bytes.</li><br>
<li>This difference is
important when dealing with multi-byte character sets, such as UTF-8,
where a single character may be represented by multiple bytes.
Example - café</li>
</ul>
</ul>

</div>

In [146]:
%%sql
SELECT name,CHAR_LENGTH(name),LENGTH(name) FROM mydb.movies
WHERE CHAR_LENGTH(name) != LENGTH(name)
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/str
10 rows affected.

[('Nausica� of the Valley of the Wind', 34, 36),
 ('9� Weeks', 8, 10),
 ('M�nage', 6, 8),
 ('La discr�te', 11, 13),
 ('Y Tu Mam� Tambi�n', 17, 21),
 ('The Naked Gun 2�: The Smell of Fear', 35, 37),
 ('The Double Life of V�ronique', 28, 30),
 ('S�lo con tu pareja', 18, 20),
 ('Mon p�re, ce h�ros.', 19, 23),
 ('Jam�n, Jam�n', 12, 16)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><h3>INSERT(str,pos,len,newstr)</h3><ul><br>
    <li>Length of the string with characters</li></ul><br>
    <ul><li>str: The original string to insert into.</li></ul>
    <ul><li>pos: The position at which to insert the new substring. The first
position is 1.</ul>
<ul><li>len: The number of characters to replace.</ul>
<ul><li>newstr: The new substring to insert.</ul>
</ul>

</div>

In [153]:
%%sql
SELECT name FROM mydb.movies
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/str
10 rows affected.

[('The Shining',),
 ('The Blue Lagoon',),
 ('Star Wars: Episode V - The Empire Strikes Back',),
 ('Airplane!',),
 ('Caddyshack',),
 ('Friday the 13th',),
 ('The Blues Brothers',),
 ('Raging Bull',),
 ('Superman II',),
 ('The Long Riders',)]

In [160]:
%%sql
SELECT name ,
INSERT(name,5,0,'\n')
FROM mydb.movies
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/str
10 rows affected.

[('The Shining', 'The \nShining'),
 ('The Blue Lagoon', 'The \nBlue Lagoon'),
 ('Star Wars: Episode V - The Empire Strikes Back', 'Star\n Wars: Episode V - The Empire Strikes Back'),
 ('Airplane!', 'Airp\nlane!'),
 ('Caddyshack', 'Cadd\nyshack'),
 ('Friday the 13th', 'Frid\nay the 13th'),
 ('The Blues Brothers', 'The \nBlues Brothers'),
 ('Raging Bull', 'Ragi\nng Bull'),
 ('Superman II', 'Supe\nrman II'),
 ('The Long Riders', 'The \nLong Riders')]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> Change length
</div>

In [166]:
%%sql
SELECT name ,
INSERT(name,5,3,'- ')
FROM mydb.movies
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/str
10 rows affected.

[('The Shining', 'The - ning'),
 ('The Blue Lagoon', 'The - e Lagoon'),
 ('Star Wars: Episode V - The Empire Strikes Back', 'Star- rs: Episode V - The Empire Strikes Back'),
 ('Airplane!', 'Airp- e!'),
 ('Caddyshack', 'Cadd- ack'),
 ('Friday the 13th', 'Frid- the 13th'),
 ('The Blues Brothers', 'The - es Brothers'),
 ('Raging Bull', 'Ragi- Bull'),
 ('Superman II', 'Supe- n II'),
 ('The Long Riders', 'The - g Riders')]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><h3>Left and Right</h3><ul><br>
    <li>Left  extract the specfic no of characters at left </li>While<li>Right use for extract the specfic no of characters at Right side  </li>
</ul>
</ul>

</div>

In [170]:
%%sql
SELECT name ,
LEFT(name,3), RIGHT(name,3)
FROM mydb.movies
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/str
10 rows affected.

[('The Shining', 'The', 'ing'),
 ('The Blue Lagoon', 'The', 'oon'),
 ('Star Wars: Episode V - The Empire Strikes Back', 'Sta', 'ack'),
 ('Airplane!', 'Air', 'ne!'),
 ('Caddyshack', 'Cad', 'ack'),
 ('Friday the 13th', 'Fri', '3th'),
 ('The Blues Brothers', 'The', 'ers'),
 ('Raging Bull', 'Rag', 'ull'),
 ('Superman II', 'Sup', ' II'),
 ('The Long Riders', 'The', 'ers')]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><h3>repeat</h3><ul><br>
    <li>Enter the string in specfic no of time</li>
</ul>
</ul>

</div>

In [186]:
%%sql
SELECT name ,REPEAT(name,2)
FROM mydb.movies
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/str
10 rows affected.

[('The Shining', 'The ShiningThe Shining'),
 ('The Blue Lagoon', 'The Blue LagoonThe Blue Lagoon'),
 ('Star Wars: Episode V - The Empire Strikes Back', 'Star Wars: Episode V - The Empire Strikes BackStar Wars: Episode V - The Empire Strikes Back'),
 ('Airplane!', 'Airplane!Airplane!'),
 ('Caddyshack', 'CaddyshackCaddyshack'),
 ('Friday the 13th', 'Friday the 13thFriday the 13th'),
 ('The Blues Brothers', 'The Blues BrothersThe Blues Brothers'),
 ('Raging Bull', 'Raging BullRaging Bull'),
 ('Superman II', 'Superman IISuperman II'),
 ('The Long Riders', 'The Long RidersThe Long Riders')]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"><h3>TRIM</h3>
    <ul>The TRIM function in SQL is used to remove specified prefixes or suffixes (or both) from a string.<br>It's commonly used to remove leading or trailing spaces from a string, but it can be more versatile depending on the database system.</ul><br><br>Syntax<ul>TRIM([ { LEADING | TRAILING | BOTH } [ trim_character ] FROM ] string_expression)<br><br>
        <ol>LEADING: Removes characters only from the beginning of the string.</ol>
                <ol>TRAILING: Removes characters only from the end of the string.</ol>
                        <ol>BOTH: Removes characters from both the beginning and the end of the string.</ol>

</ul></div>

In [196]:
%sql SELECT '.......Hello...World.......' AS string

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[('.......Hello...World.......',)]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">remove dots from right side</div>

In [228]:
%sql SELECT TRIM(TRAILING '.' FROM '.......Hello...World.......') AS trimmed_string;

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[('.......Hello...World',)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">remove dots from Left side</div>

In [198]:
%sql SELECT TRIM(LEADING '.' FROM '.......Hello...World.......') AS trimmed_string;

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[('Hello...World.......',)]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">remove dots from Both side</div>

In [199]:
%sql SELECT TRIM(BOTH '.' FROM '.......Hello...World.......') AS trimmed_string;

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[('Hello...World',)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><h3>substring_index(string,spliter,occeranace)</h3><ul><br>
    <li>Split the string with specfic occerance</li>
</ul>
</ul>

</div>

In [230]:
%sql SELECT 'www.google.com' as link

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[('www.google.com',)]

In [233]:
%sql SELECT SUBSTRING_INDEX('www.google.com','.',1) as link

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[('www',)]

In [241]:
%sql SELECT SUBSTRING_INDEX('www.google.com','.',2) as link

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[('www.google',)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Also use negative index</div>

In [236]:
%sql SELECT SUBSTRING_INDEX('www.google.com','.',-1) as link

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[('com',)]

In [242]:
%sql SELECT SUBSTRING_INDEX('www.google.com','.',-2) as link

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[('google.com',)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><h3>strcmp</h3><ul><br>
    <li>The STRCMP() function returns an integer that indicates the
relationship between the two strings alphabetically :<br><br>
        <ul><li>If str1 is equal to str2, the function returns 0.</li></ul>
        <ul><li>If str1 is greater than str2, the function returns a positive
integer.</li></ul>
        <ul><li>If str1 is less than str2, the function returns a negative integer.</li></ul>


</li>
</ul>
</ul>

</div>

In [243]:
%sql SELECT strcmp('A','B')

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[(-1,)]

In [244]:
%sql SELECT strcmp('B','A')

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[(1,)]

In [245]:
%sql SELECT strcmp('A','A')

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[(0,)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><h3>Locate(findstring,string)</h3><ul><br>
    <li>Return a Index of specfic string</li>
</ul>
</ul>

</div>

In [255]:
%sql SELECT LOCATE('e','Mubeen')

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[(4,)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
    we also change the strting position<br><br>
    Here i need to find the 2nd e SO i change the start postion form 5
</div>

In [272]:
%sql SELECT LOCATE('e','Mubeen',5)

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[(5,)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><h3>lpad and rpad</h3><ul><br>
    <li>add a specfic characters</li>
</ul>
</ul>

</div>

In [299]:
%sql SELECT LPAD('Mubeen', LENGTH('Mubeen')+1, '*') AS s;

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[('*Mubeen',)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">use rpad for padding right side</div>

In [300]:
%sql SELECT RPAD('Mubeen', LENGTH('Mubeen')+1, '*') AS s;

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[('Mubeen*',)]

In [301]:
%sql SELECT RPAD('Mubeen', LENGTH('Mubeen')+4, '*') AS s;

 * mysql+pymysql://root:***@localhost:3307/str
1 rows affected.

[('Mubeen****',)]